#+TITLE: Exercise 3.7
 Consider the bank account objects created by make-account, with the password modification described in Exercise 3.3. Suppose that our banking system requires the ability to make joint accounts. Define a procedure make-joint that accomplishes this. Make-joint should take three arguments. The first is a password-protected account. The second argument must match the password with which the account was defined in order for the make-joint operation to proceed. The third argument is a new password. Make-joint is to create an additional access to the original account using the new password. For example, if peter-acc is a bank account with password open-sesame, then

#+BEGIN_SRC scheme :eval no
  (define paul-acc
   (make-joint peter-acc 
               'open-sesame 
               'rosebud))
#+END_SRC 

 will allow one to make transactions on peter-acc using the name paul-acc and the password rosebud. You may wish to modify your solution to Exercise 3.3 to accommodate this new feature.

** Passwords
Test first owner
#+BEGIN_SRC scheme :session make-acc-joint :exports both
  ((peter-acc 'peter-password 'withdraw) 10)
#+END_SRC

#+EXPORTS:
: 90

Test second owner
#+BEGIN_SRC scheme :session make-acc-joint :exports both
  ((paul-acc 'paul-password 'withdraw) 5)
#+END_SRC

#+RESULTS:
: 85

Test with invalid password with second owner
#+BEGIN_SRC scheme :session make-acc-joint :exports both
  ((paul-acc 'paul-invalid 'withdraw) 5)
#+END_SRC

#+RESULTS:
: Invalid Password

First owner tries to login with the password of the second owner
#+BEGIN_SRC scheme :session make-acc-joint :exports both
  ((peter-acc 'paul-password 'withdraw) 0)
#+END_SRC

#+RESULTS:
: Incorrect password

Second owner tries to login with the password of the first owner
#+BEGIN_SRC scheme :session make-acc-joint :exports both
  ((paul-acc 'peter-password 'withdraw) 0)
#+END_SRC

#+RESULTS:
: Invalid Password

** Account states
Test deposit from second owner
#+BEGIN_SRC scheme :session make-acc-joint :exports both
  ((paul-acc 'paul-password 'deposit) 20)
#+END_SRC

#+RESULTS:
: 105

Test balance from first owner
#+BEGIN_SRC scheme :session make-acc-joint :exports both
  ((peter-acc 'peter-password 'deposit) 0)
#+END_SRC

#+RESULTS:
: 105
